Обработки/Reports/_КонтрольНаличияВРИОСпециальногоДолжностногоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КонтрольНаличияВРИОСпециальногоДолжностногоЛица</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопСвойства</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КонтрольНаличияВРИОСпециальногоДолжностногоЛица/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Контроль наличия ВРИО специального должностного лица",
		"0.08",
		"",
		Истина);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "КонтрольНаличияПриказовНазаначенияПрекращенияВРИО_СДЛ", "Контроль наличия приказов назначения/прекращения ВРИО",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ФормированиеЕжеквартальногоОтчета_4662У", "Формирование ежеквартального отчета 4662-У",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции 

// Интерфейс для формирования отчета и отправки на почту по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт 
		
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
	ЭтотОбъект.Организация = ПараметрыКоманды.Организация;
	ЭтотОбъект.ДопСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);
	
	Если ИдентификаторКоманды = "КонтрольНаличияПриказовНазаначенияПрекращенияВРИО_СДЛ" Тогда 
		
		ЭтотОбъект.Период.ДатаНачала = НачалоДня(ТекущаяДата()) - (24 * 60 *60);
		ЭтотОбъект.Период.ДатаОкончания = КонецДня(ЭтотОбъект.Период.ДатаНачала);

		ПроверитьПриказыНазаначенияПрекращенияВРИО_СДЛ();
		
	ИначеЕсли ИдентификаторКоманды = "ФормированиеЕжеквартальногоОтчета_4662У" Тогда
		
		СформироватьЕжеквартальныйОтчет();
		
	Иначе
		ЗарегистрироватьОшибку("Не описаны действия для команды [" + ИдентификаторКоманды + "].");	
	КонецЕсли; 
	
	ОповеститьОбОшибках();
		
КонецПроцедуры

Процедура СформироватьЕжеквартальныйОтчет(ИнтерактивныйВызов = Ложь) Экспорт 
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьЕжеквартальныйОтчет()";
	ПараметрыВыполнения = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Организация", Новый Структура("ИнтерактивныйВызов", ИнтерактивныйВызов));
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
		
	Вложения = Новый Соответствие;
	
	ДатаФормированияОтчета = НачалоДня(ТекущаяДата());
	
	Если Не ИнтерактивныйВызов Тогда
						
		Если Не ЭтоПервыйРабочийДеньКвартала(ДатаФормированияОтчета) Тогда
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("ДатаФормирования", Формат(ДатаФормированияОтчета, "ДФ=dd.MM.yyyy")));
			Возврат;	
		КонецЕсли;
		
		ЭтотОбъект.Период.ДатаОкончания = НачалоКвартала(ДатаФормированияОтчета) - 1;
		ЭтотОбъект.Период.ДатаНачала = НачалоКвартала(ЭтотОбъект.Период.ДатаОкончания);
			
	КонецЕсли;
		
	ТаблицаДанных = ПолучитьДанныеЗаПериод();
	ТаблицаДанных.Колонки.Добавить("Уведомление", Новый ОписаниеТипов("Строка"));
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		
		СДЛ = РегистрыСведений.ДолжностныеЛицаОрганизаций.ПолучитьДолжностноеЛицо(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Организация, Перечисления.ВидыДолжностныхЛиц.СпециальноеДолжностноеЛицо);
		
		Если СДЛ = Неопределено Тогда
			
			ТекстОповещения = "При формировании отчета не удалось определить специальное должностное лицо.";
			
		Иначе

			ТекстОповещения =
				"У СДЛ [" + СДЛ + "] не найдено отсутствий по причине отпуска и/или болезни, сверьте данные с кадровой программой учета.
				|Если отсутствий нет, отчет 4662-У не отправляется.";
			
		КонецЕсли;
			
		СформироватьОповещение(ТекстОповещения, Истина);	
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("Период", ЭтотОбъект.Период));
		Возврат;
		
	Конецесли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставу,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРН
		|ПОМЕСТИТЬ _РеквизитыОрганизации
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&ДатаФормированияОтчета,
		|			ЮрФизЛицо = &ЮрЛицоОрганизации
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДолжностныеЛицаОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.ИсполняющийОбязанности КАК ИсполняющийОбязанности,
		|	ДолжностныеЛицаОрганизацийСрезПоследних.ВидДолжностногоЛица КАК ВидДолжностногоЛица
		|ПОМЕСТИТЬ _ДолжностныеЛица
		|ИЗ
		|	РегистрСведений.ДолжностныеЛицаОрганизаций.СрезПоследних(
		|			&ДатаФормированияОтчета,
		|			Организация = &Организация
		|				И ВидДолжностногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыДолжностныхЛиц.Руководитель), ЗНАЧЕНИЕ(Перечисление.ВидыДолжностныхЛиц.Контролер))) КАК ДолжностныеЛицаОрганизацийСрезПоследних
		|ГДЕ
		|	(ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КОНЕЦПЕРИОДА(ДолжностныеЛицаОрганизацийСрезПоследних.ДатаОкончания, ДЕНЬ) >= &ДатаФормированияОтчета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанкРоссии.Ссылка КАК Получатель,
		|	Руководитель.ФизЛицо КАК Подписал,
		|	Контролер.ФизЛицо КАК Исполнитель,
		|	Контролер.Пользователь КАК Ответственный
		|ПОМЕСТИТЬ _ДанныеИсходящегоДокумента
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		ИменованныеОбъекты.Объект КАК Ссылка
		|	ИЗ
		|		РегистрСведений.ИменованныеОбъекты КАК ИменованныеОбъекты
		|	ГДЕ
		|		ИменованныеОбъекты.Имя = &ИмяОбъекта) КАК БанкРоссии
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			_ДолжностныеЛица.Сотрудник.ЮрФизЛицо КАК ФизЛицо
		|		ИЗ
		|			_ДолжностныеЛица КАК _ДолжностныеЛица
		|		ГДЕ
		|			_ДолжностныеЛица.ВидДолжностногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыДолжностныхЛиц.Руководитель)
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			_ДолжностныеЛица.ИсполняющийОбязанности УБЫВ) КАК Руководитель
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			_ДолжностныеЛица.Сотрудник.ЮрФизЛицо КАК ФизЛицо,
		|			Пользователи.Ссылка КАК Пользователь
		|		ИЗ
		|			_ДолжностныеЛица КАК _ДолжностныеЛица
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|				ПО _ДолжностныеЛица.Сотрудник.ЮрФизЛицо = Пользователи.ЮрФизЛицо
		|					И (Пользователи.Организация = &Организация)
		|					И (НЕ Пользователи.ВходЗапрещен)
		|		ГДЕ
		|			_ДолжностныеЛица.ВидДолжностногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыДолжностныхЛиц.Контролер)
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			_ДолжностныеЛица.ИсполняющийОбязанности УБЫВ) КАК Контролер
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсходящийДокумент.Ссылка КАК Ссылка,
		|	ИсходящийДокумент.Дата КАК Дата,
		|	ИсходящийДокумент.Номер КАК Номер,
		|	ИсходящийДокумент.Описание КАК Описание
		|ПОМЕСТИТЬ _ИсходящиеДокументыУчетнойСистемы
		|ИЗ
		|	Документ.ИсходящийДокумент КАК ИсходящийДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеИсходящегоДокумента КАК _ДанныеИсходящегоДокумента
		|		ПО ИсходящийДокумент.Получатель = _ДанныеИсходящегоДокумента.Получатель
		|			И (ИсходящийДокумент.Организация = &Организация)
		|			И (НЕ ИсходящийДокумент.ПометкаУдаления)
		|			И (ИсходящийДокумент.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаФормированияОтчета, КВАРТАЛ) И КОНЕЦПЕРИОДА(&ДатаФормированияОтчета, КВАРТАЛ))
		|			И (ИсходящийДокумент.Описание ПОДОБНО ""%4662%"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизацииСрезПоследних.Должность КАК ПодписантДолжность,
		|	ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, 1, 1) + "". "" + ВЫБОР
		|		КОГДА РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество = """"
		|			ТОГДА """"
		|		ИНАЧЕ ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, 1, 1) + "". ""
		|	КОНЕЦ + РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия КАК ПодписантИнициалыФамилия
		|ИЗ
		|	_ДанныеИсходящегоДокумента КАК _ДанныеИсходящегоДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(&ДатаФормированияОтчета, Организация = &Организация) КАК СотрудникиОрганизацииСрезПоследних
		|		ПО _ДанныеИсходящегоДокумента.Подписал = СотрудникиОрганизацииСрезПоследних.Сотрудник.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&ДатаФормированияОтчета,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
		|		ПО _ДанныеИсходящегоДокумента.Подписал = РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	ЕСТЬNULL(СотрудникиОрганизацииСрезПоследних.ВидСобытия, ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)) <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)";
#КонецОбласти

	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрЛицоОрганизации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо")); 
	Запрос.УстановитьПараметр("ДатаФормированияОтчета", ?(ИнтерактивныйВызов, ЭтотОбъект.Период.ДатаОкончания, ДатаФормированияОтчета));
	Запрос.УстановитьПараметр("ИмяОбъекта", "ЮрЛицо_ЦБРФ");
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не ИнтерактивныйВызов Тогда
	
		ИсходящиеДокументыУчетнойСистемы = Запрос.МенеджерВременныхТаблиц.Таблицы["_ИсходящиеДокументыУчетнойСистемы"].ПолучитьДанные().Выбрать();
		
		Если ИсходящиеДокументыУчетнойСистемы.Следующий() Тогда 
			
			ТекстОшибки = "В учетной системе найден ранее созданный документ [" + ИсходящиеДокументыУчетнойСистемы.Ссылка + "]. Описание [" + ИсходящиеДокументыУчетнойСистемы.Описание + "]."; 
			
			ЗарегистрироватьОшибку(ТекстОшибки);	
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("Период", ЭтотОбъект.Период), ТекстОшибки);
			Возврат; 
			
		Иначе
			
			Описание = "Отчет 4662-У за " + Месяц(КонецКвартала(ЭтотОбъект.Период.ДатаОкончания)) / 3 + " квартал " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ='yyyy ""года""'"); 
			
			ДанныеИсходящегоДокумента = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеИсходящегоДокумента"].ПолучитьДанные().Выбрать();
			
			ИсходящийДокумент = Документы.ИсходящийДокумент.СоздатьДокумент();
			ИсходящийДокумент.Организация = ЭтотОбъект.Организация;
			ИсходящийДокумент.Дата = ТекущаяДатаСеанса();
			ИсходящийДокумент.ТипИсходящегоДокумента = Перечисления.ТипыИсходящихДокументов.Прочее;
			ИсходящийДокумент.Описание = Описание + "."; 
			ИсходящийДокумент.ПоСобственнойДеятельностиУК = Истина;
			
			Если ДанныеИсходящегоДокумента.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ИсходящийДокумент, ДанныеИсходящегоДокумента);
			Иначе	
				
				ТекстОшибки = "Не удалось определить получателя, исполнителя и подписанта при создании исходящего документа [Описание: " + Описание + "]. Организация [" + ЭтотОбъект.Организация + "].";
				
				ЗарегистрироватьОшибку(ТекстОшибки);
				РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("Период", ЭтотОбъект.Период), ТекстОшибки);
				Возврат;
				
			КонецЕсли;
			
			Попытка	
				ИсходящийДокумент.Записать(РежимЗаписиДокумента.Запись);	
			Исключение	
				
				ТекстОшибки = "Не удалось провести исходящий документ [Описание: " + Описание + "]. Организация [" + ЭтотОбъект.Организация + "]. " + ОписаниеОшибки();
				
				ЗарегистрироватьОшибку(ТекстОшибки);
				РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("Период", ЭтотОбъект.Период), ТекстОшибки);
				Возврат;
				
			КонецПопытки;
		
		КонецЕсли;
		
	КонецЕсли;
		
	МакетОтчета = ЭтотОбъект.ПолучитьМакет("Отчет4662У");
	ОбластьПервыйЛист = МакетОтчета.ПолучитьОбласть("ПервыйЛист"); 
	
	РеквизитыОрганизации = Запрос.МенеджерВременныхТаблиц.Таблицы["_РеквизитыОрганизации"].ПолучитьДанные().Выбрать();
	
	Если РеквизитыОрганизации.Следующий() Тогда
		ОбластьПервыйЛист.Параметры.НаименованиеОрганизации = РеквизитыОрганизации.ПолноеНаименованиеПоУставу;
		ОбластьПервыйЛист.Параметры.ОГРН = РеквизитыОрганизации.ОГРН;
	КонецЕсли;

	ОбластьПервыйЛист.Параметры.ДатаПисьма = Формат(?(ИнтерактивныйВызов, ДатаФормированияОтчета, ИсходящийДокумент.Дата), "ДФ=dd.MM.yyyy");
	ОбластьПервыйЛист.Параметры.НомерПисьма = ?(ИнтерактивныйВызов, "", СокрЛП(ИсходящийДокумент.Номер));
	ОбластьПервыйЛист.Параметры.ОтчетныйПериод = Строка(Месяц(КонецКвартала(ЭтотОбъект.Период.ДатаОкончания)) / 3) + "." + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyy.");
		
	ДокументПервыйЛист = Новый ТабличныйДокумент;
	ДокументПервыйЛист.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	
	ДокументПервыйЛист.Вывести(РаботаСОтчетами.ПолучитьШапкуОфициальногоБланкаОрганизации(ЭтотОбъект.Организация, ЭтотОбъект.Период.ДатаНачала));
	ДокументПервыйЛист.Вывести(ОбластьПервыйЛист);
	
	ДокументПервыйЛист.ВывестиГоризонтальныйРазделительСтраниц();
	
	ДокументВторойЛист = Новый ТабличныйДокумент;
	ДокументВторойЛист.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументВторойЛист.Вывести(МакетОтчета.ПолучитьОбласть("Шапка"));
	
	ОбластьСтрока = МакетОтчета.ПолучитьОбласть("Строка");
	
	Для Инд = 0 По ТаблицаДанных.Количество() - 1 Цикл
		
		СтрокаТаблицы = ТаблицаДанных[Инд];
		
		ОбластьСтрока.Параметры.Номер = Инд + 1;
		ОбластьСтрока.Параметры.СотрудникВРИО = СтрокаТаблицы.СотрудникВРИО;
		ОбластьСтрока.Параметры.ДолжностьВРИО = СформироватьТекстНаименованияДолжности("ВРИО", СтрокаТаблицы); 
		ОбластьСтрока.Параметры.ДолжностьСДЛ = СформироватьТекстНаименованияДолжности("СДЛ", СтрокаТаблицы);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаС) И СтрокаТаблицы.ДатаС >= ЭтотОбъект.Период.ДатаНачала Тогда
			ОбластьСтрока.Параметры.ДатаС = Формат(СтрокаТаблицы.ДатаС, "ДФ=dd.MM.yyyy");
		Иначе
			ОбластьСтрока.Параметры.ДатаС = "";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) И СтрокаТаблицы.ДатаОкончания <= ЭтотОбъект.Период.ДатаОкончания Тогда
			ОбластьСтрока.Параметры.ДатаПо = Формат(СтрокаТаблицы.ДатаОкончания, "ДФ=dd.MM.yyyy");
		Иначе
			ОбластьСтрока.Параметры.ДатаПо = "";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПриказНазначенияВРИО) Тогда
					
			РеквизитыПриказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ПриказНазначенияВРИО, Новый Структура("Номер, Дата"));	
			ОбластьСтрока.Параметры.НомерДокумента = "Приказ № " + СокрЛП(РеквизитыПриказа.Номер) + " от " + Формат(РеквизитыПриказа.Дата, "ДФ='dd.MM.yyyy ""г.""'");
			
		КонецЕсли;
		
		Если Не ИнтерактивныйВызов Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПриказНазначенияВРИО) Тогда
					 
				ДанныеФайлов = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(СтрокаТаблицы.ПриказНазначенияВРИО);
				
				Если ДанныеФайлов.Количество() = 0 Тогда
					СтрокаТаблицы.Уведомление = СтрокаТаблицы.Уведомление + "Не найден файл документа [" + СтрокаТаблицы.ПриказНазначенияВРИО + "].";	
				Иначе
				
					Для Каждого ЭлементДанных Из ДанныеФайлов Цикл
						
						ДанныеФайла = РаботаСФайловымХранилищем.ПолучитьФайл(ЭлементДанных.ИдентификаторФайла);
						Вложения.Вставить(ДанныеФайла.Имя + "." + ДанныеФайла.Расширение, ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес));
						
						СтрокаТаблицы.Уведомление = СтрокаТаблицы.Уведомление + "Файл [" + ДанныеФайла.Имя + "." + ДанныеФайла.Расширение + "] во вложении.";
						
					КонецЦикла;
					
				КонецЕсли;
							
			Иначе
				СтрокаТаблицы.Уведомление =
					"Не удалось получить приказ о временном исполнении обязанностей во время отсутствия [" 
					+ Формат(СтрокаТаблицы.ДатаС, "ДФ=dd.MM") + " - " + Формат(СтрокаТаблицы.ДатаПо, "ДФ=dd.MM.yyyy") + "] сотрудника [" 
					+ СтрокаТаблицы.СотрудникСДЛ + "] по причине [" + СтрокаТаблицы.Состояние + "]";	
			КонецЕсли; 
					
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПриказПрекращенияВРИО) Тогда
			
				ДанныеФайлов = РаботаСФайловымХранилищем.ПолучитьСписокФайлов(СтрокаТаблицы.ПриказПрекращенияВРИО); 
				
				Если ДанныеФайлов.Количество() = 0 Тогда
					СтрокаТаблицы.Уведомление = СтрокаТаблицы.Уведомление + "Не найден файл документа [" + СтрокаТаблицы.ПриказПрекращенияВРИО + "].";	
				Иначе
					
					Для Каждого ЭлементДанных Из ДанныеФайлов Цикл
						
						ДанныеФайла = РаботаСФайловымХранилищем.ПолучитьФайл(ЭлементДанных.ИдентификаторФайла);
						Вложения.Вставить(ДанныеФайла.Имя + "." + ДанныеФайла.Расширение, ПолучитьИзВременногоХранилища(ДанныеФайла.Адрес));
						
						СтрокаТаблицы.Уведомление = СтрокаТаблицы.Уведомление + "Файл [" + ДанныеФайла.Имя + "." + ДанныеФайла.Расширение + "] во вложении.";
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДокументВторойЛист.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	ОбластьПодвал = МакетОтчета.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ЧислоЛистов = ТаблицаДанных.Количество();
	ОбластьПодвал.Параметры.ДатаПодписания = Формат(ДатаФормированияОтчета, "ДФ='dd.MM.yyyy ""г.""'");

	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбластьПодвал.Параметры.ДолжностьПодписанта = Выборка.ПодписантДолжность;
		ОбластьПодвал.Параметры.Подписант = Выборка.ПодписантИнициалыФамилия; 
	КонецЕсли;
		
	ДокументВторойЛист.Вывести(ОбластьПодвал);
	
	ПакетДокументов = Новый ПакетОтображаемыхДокументов;
	
	ЭлементПервыйЛист = ПакетДокументов.Состав.Добавить();
	ЭлементПервыйЛист.Данные = ПоместитьВоВременноеХранилище(ДокументПервыйЛист, Новый УникальныйИдентификатор);
	
	ЭлементВторойЛист = ПакетДокументов.Состав.Добавить();
	ЭлементВторойЛист.Данные = ПоместитьВоВременноеХранилище(ДокументВторойЛист, Новый УникальныйИдентификатор);
	
	Если ИнтерактивныйВызов Тогда 
		
		ЭтотОбъект.ДопСвойства.Вставить("ПакетДокументов", ПакетДокументов);
		
	Иначе
		
		ИмяФайла = "Отчет_4662_У_" + Месяц(КонецКвартала(ЭтотОбъект.Период.ДатаОкончания)) / 3 + "_квартал_" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=yyyy") + ".docx";
		
		ВременныйАдресФайла = ПолучитьИмяВременногоФайла("docx");
		ПакетДокументов.Записать(ВременныйАдресФайла, ТипФайлаПакетаОтображаемыхДокументов.DOCX);

		БинарныйФайл = Новый ДвоичныеДанные(ВременныйАдресФайла);
		
		Вложения.Вставить(ИмяФайла, БинарныйФайл);
		
		ОписаниеПереданногоФайла = Новый Структура;
		ОписаниеПереданногоФайла.Вставить("ПолноеИмя", ИмяФайла);
		ОписаниеПереданногоФайла.Вставить("Хранение", ПоместитьВоВременноеХранилище(БинарныйФайл));
				
		ФайлОтчет = РаботаСКоллекциями.ЗначениеВМассив(ОписаниеПереданногоФайла);
		
		ДанныеВерсий = Обработки.РаботаСФайлами.ПрисоединитьФайл(ИсходящийДокумент.Ссылка, ФайлОтчет);
		
		Если ДанныеВерсий.Количество() = 0 Тогда
			
			СтрокаТаблицы.Уведомление = СтрокаТаблицы.Уведомление + Символы.ПС + 
				"Не удалось присоединить файл [" + ИмяФайла + "] к исходящему документу [" + СокрЛП(ИсходящийДокумент.Номер) + "]";
			
		Иначе
			
			Для Каждого ЗаписьВерсии Из ДанныеВерсий Цикл
				
				Если ЗаписьВерсии.Свойство("ТекстОшибки") Тогда
					СтрокаТаблицы.Уведомление = СтрокаТаблицы.Уведомление + Символы.ПС + ЗаписьВерсии.ТекстОшибки;	
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли;
				
		СформироватьОповещение(ТаблицаДанных, Истина, ИсходящийДокумент.Ссылка, Вложения);
		
	КонецЕсли;
		
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("Период", ЭтотОбъект.Период));
		
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);	
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполнения = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период, Организация", Новый Структура("ВариантОтчета", ВариантОтчета));
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
		
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Параметры.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Параметры.УстановитьЗначениеПараметра("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("КонецПериода", ЭтотОбъект.Период.ДатаОкончания);
	
	ЭлементыКомпановки = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	
	Для Каждого ТекЭлемент Из ЭлементыКомпановки Цикл
		
		Если ТекЭлемент.Поле = Новый ПолеКомпоновкиДанных("ФлКонтрольПриказаПрекращенияВРИО") Тогда
			ТекЭлемент.Использование = Ложь;
		КонецЕсли;	
				
	КонецЦикла;

	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,,, Новый Структура("РегистрацияСтатистики", Ложь));
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
			
КонецПроцедуры

Процедура ПроверитьПриказыНазаначенияПрекращенияВРИО_СДЛ()
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПроверитьПриказыНазаначенияПрекращенияВРИО_СДЛ()";
	ПараметрыВыполнения = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период, Организация");
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
		
	ТаблицаДанных = ПолучитьДанныеЗаПериод();
	ТаблицаДанных.Колонки.Добавить("Уведомление", Новый ОписаниеТипов("Строка"));
				
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл	
				
		Если Справочники.Календари.КоличествоРабочихДней(Справочники.Календари.Общероссийский, СтрокаТаблицы.ДатаС, ЭтотОбъект.Период.ДатаНачала) < 3 Тогда 
			
			//Если есть приказ о назначении ВРИО -> оповещаем только два раза: Т-1, Т-2
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПриказНазначенияВРИО) Тогда
				
				СтрокаТаблицы.Уведомление = 
					"Найден документ [" + СтрокаТаблицы.ПриказНазначенияВРИО + "] о назначении ВРИО СДЛ [" + СтрокаТаблицы.СотрудникСДЛ + "].
					|Проверьте необходимость направления данных в ЦБ.";	
				
			ИначеЕсли СтрокаТаблицы.Состояние = Перечисления.СостоянияСотрудникаОрганизации.Увольнение Тогда 
				
				СтрокаТаблицы.Уведомление = 
					"Сотрудник [" + СтрокаТаблицы.СотрудникСДЛ + "] уволен с [" + Формат(СтрокаТаблицы.ДатаС, "ДФ=dd.MM.yyyy") + "].
					|Необходимо назначить специальное должностное лицо.";
					
			Иначе	
				СтрокаТаблицы.Уведомление = 
					"Не найден приказ о назначени ВРИО СДЛ. Сотрудник [" + СтрокаТаблицы.СотрудникСДЛ + "] отсутсвует с [" + Формат(СтрокаТаблицы.ДатаС, "ДФ=dd.MM.yyyy") + "].
					|Проверьте необходимость принятия приказа о назначении ВРИО.";
				
			КонецЕсли;
		
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТаблицы.ПриказНазначенияВРИО) Тогда 
			
			СтрокаТаблицы.Уведомление = 
				"Не найден приказ о назначени ВРИО СДЛ. Сотрудник [" + СтрокаТаблицы.СотрудникСДЛ + "] отсутсвует с [" + Формат(СтрокаТаблицы.ДатаС, "ДФ=dd.MM.yyyy") + "].
	            |Внимательно проверьте данные об исполняющем обязанности и возможности его назначения.";
			
		КонецЕсли;
			
		Если СтрокаТаблицы.ДатаПо = ЭтотОбъект.Период.ДатаНачала И СтрокаТаблицы.ФлКонтрольПриказаПрекращенияВРИО
			И Не ЗначениеЗаполнено(СтрокаТаблицы.ПриказПрекращенияВРИО) Тогда
			
			СтрокаТаблицы.Уведомление = СтрокаТаблицы.Уведомление + Символы.ПС +
				"Проверьте необходимость принятия приказа о прекращении временного исполнения обязанностей СДЛ." 
				+ ?(ЗначениеЗаполнено(СтрокаТаблицы.СотрудникВРИО), " [" + СтрокаТаблицы.СотрудникВРИО + "].", "");
	
		КонецЕсли; 
							
	КонецЦикла; 
	
	Если ТаблицаДанных.Количество() > 0 Тогда
			
		СформироватьОповещение(ТаблицаДанных);
			
	Иначе
		
		СДЛ = РегистрыСведений.ДолжностныеЛицаОрганизаций.ПолучитьДолжностноеЛицо(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Организация, Перечисления.ВидыДолжностныхЛиц.СпециальноеДолжностноеЛицо);
	
		Если СДЛ = Неопределено Тогда
		
			СформироватьОповещение("Не удалось определить специальное должностное лицо. Проверьте необходимость принятия приказа о назначении должностного лица.");
		
		КонецЕсли;
		
	КонецЕсли;

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры 

Функция ЭтоПервыйРабочийДеньКвартала(ТекДата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата,
		|	ДанныеКалендаря.ВидДня КАК ВидДня
		|ПОМЕСТИТЬ _ДанныеКалендаря
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоКвартала И &ТекДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеКалендаря.Дата = &ТекДата
		|		И _ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)) КАК ЭтоПервыйРабочийДеньКвартала
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(_ДанныеКалендаря.Дата) КАК МинДата
		|	ИЗ
		|		_ДанныеКалендаря КАК _ДанныеКалендаря
		|	ГДЕ
		|		_ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеКалендаря КАК _ДанныеКалендаря
		|		ПО ВложенныйЗапрос.МинДата = _ДанныеКалендаря.Дата";
	
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("НачалоКвартала", НачалоКвартала(ТекДата));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭтоПервыйРабочийДеньКвартала;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеЗаПериод() 
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	Параметры.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Параметры.УстановитьЗначениеПараметра("НачалоПериода", ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("КонецПериода", ЭтотОбъект.Период.ДатаОкончания); 
	
	ЭлементыКомпановки = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	
	Для Каждого ТекЭлемент Из ЭлементыКомпановки Цикл
		
		Если ТекЭлемент.Поле = Новый ПолеКомпоновкиДанных("ФлКонтрольПриказаПрекращенияВРИО") Тогда
			ТекЭлемент.Использование = Истина;
		КонецЕсли;	
				
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(),,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки); 
	
	ПроцессорВывода = Новый	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	Возврат ТаблицаДанных; 
	
КонецФункции

Функция СформироватьТекстНаименованияДолжности(Статус, Запись)
	
	Текст = ""; 
	ВнутрСовместительствоСДЛ = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СотрудникСДЛ, "ВидЗанятости") = Перечисления.ВидыЗанятостиСотрудников.ВнутреннееСовместительство); 
	ВнешнСовместительствоСДЛ = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.СотрудникСДЛ, "ВидЗанятости") = Перечисления.ВидыЗанятостиСотрудников.Совместительство);
	
	Если Статус = "ВРИО" Или Не (ВнутрСовместительствоСДЛ Или ВнешнСовместительствоСДЛ) Тогда
		
		Если ЗначениеЗаполнено(Запись["Должность" + Статус]) Тогда 
			Текст = Строка(Запись["Должность" + Статус]) + ", " + НРег(Сред(Запись["Подразделение" + Статус], СтрНайти(Нрег(Запись["Подразделение" + Статус]), "отдел"))) + ".";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Статус = "ВРИО" Или ВнутрСовместительствоСДЛ Или ВнешнСовместительствоСДЛ Тогда
		
		Если ЗначениеЗаполнено(Запись["ДолжностьСовместительства" + Статус]) Тогда
			
			Текст = Текст + ?(Текст = "", "", " ") 
					+ Строка(Запись["ДолжностьСовместительства" + Статус]) + ", " 
					+ НРег(Сред(Запись["ПодразделениеСовместительства" + Статус], СтрНайти(Нрег(Запись["ПодразделениеСовместительства" + Статус]), "отдел"))) 
					+ ?(Статус = "ВРИО", ?(ВнутрСовместительствоСДЛ, " (внутреннее совместительство).", " (совместительство)."), ".");
						
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Процедура СформироватьОповещение(ДанныеОповещения, Отчет_4662У = Ложь, ДокСсылка = Неопределено, Вложения = Неопределено)
	
	ТекстОповещения = "";
	
	Если ТипЗнч(ДанныеОповещения) = Тип("Строка") И ДанныеОповещения <> "" Тогда
		
		ТекстОповещения = "<table cols=""1""><tr class=""top""><td>Комментарий</td></tr><tr><td>" + ДанныеОповещения + "</td></tr></table></body></html>";
		
	ИначеЕсли ТипЗнч(ДанныеОповещения) = Тип("ТаблицаЗначений") Тогда
	
		Для Каждого СтрокаТаблицы Из ДанныеОповещения Цикл 
			
			Если Отчет_4662У Или ЗначениеЗаполнено(СтрокаТаблицы.Уведомление) Тогда
			
				ТекстОповещения = ТекстОповещения 
					+ "<tr><td>" + Формат(СтрокаТаблицы.ДатаС, "ДФ=dd.MM.yyyy") + "</td><td>" + Формат(СтрокаТаблицы.ДатаПо, "ДФ=dd.MM.yyyy") 
					+ "</td><td>" + СтрокаТаблицы.Состояние + "</td><td>" + СтрокаТаблицы.СотрудникСДЛ 
					+ "</td><td>" + СтрокаТаблицы.ДолжностьСДЛ + "</td><td class =""mistake"">" + СтрокаТаблицы.Уведомление + "</td></tr>";
					
			КонецЕсли;
		
		КонецЦикла;
			
		Если ТекстОповещения <> "" Тогда
				
			ТекстОповещения = "<table cols=""6"">
				|<tr class=""top""><td colspan=""3"">Отсутствие</td><td colspan=""2"">Специальное должностное лицо</td><td rowspan=""2"">Комментарий</td></tr>
				|<tr class=""top""><td>С</td><td>По</td><td>Состояние</td><td>Сотрудник</td><td>Должность</td></tr>"
				+ ТекстОповещения + "</table></body></html>";
				
		КонецЕсли;
			
	Иначе
		Возврат;			 	 	 
	КонецЕсли; 
	
	Если ТекстОповещения <> "" Тогда
	
	   	ТекстОповещения =
			"<html>
			|<head content=""text/html"" http-equiv=""Content-Type"" charset=""utf-8"">
			|	<style type=""text/css"">
			|		body     { font-family: ""Arial""; font-size: 12px; }
			|		table    { text-align: left; border-spacing: 0; border-collapse: collapse; }
			|		td       { border: 1px solid #CCC085; padding: 5px; }
			|		.top     { background: #F4ECC5; }
			|		.mistake { background: #FFA07A; }
			|	</style>
			|</head><body>"
			+ ?(ДокСсылка = Неопределено, "", "<h3>" + ОбщегоНазначения.ПолучитьГиперссылкуНаОбъект(ДокСсылка, Строка(ДокСсылка)) + "</h3>")
			+ ТекстОповещения;

		РеквизитыОповещения = Новый Структура();
		РеквизитыОповещения.Вставить("Организация", ЭтотОбъект.Организация);
		РеквизитыОповещения.Вставить("Отчет_4662У", Отчет_4662У);
		РеквизитыОповещения.Вставить("Текст", ТекстОповещения); 
		
		Если Отчет_4662У Тогда
			РеквизитыОповещения.Вставить("ПериодСтрокой", "за " + Месяц(ЭтотОбъект.Период.ДатаОкончания) / 3 + " квартал " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ='yyyy ""года""'"));	
		КонецЕсли;
		
		Если Вложения <> Неопределено Тогда
			РеквизитыОповещения.Вставить("Вложения", Вложения);
		КонецЕсли;
		
		Справочники.Оповещения.СформироватьОповещения("Обработка.КонтрольНаличияВРИОСпециальногоДолжностногоЛица", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
	КонецЕсли;		
	
КонецПроцедуры 

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДопСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДопСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДопСвойства.Ошибки.Найти(ТекстОшибки) = Неопределено Тогда
		ЭтотОбъект.ДопСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОповеститьОбОшибках()
	
	Если Не ЭтотОбъект.ДопСвойства.Свойство("Ошибки") Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЭтотОбъект.ДопСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДопСвойства.Ошибки, ЭтотОбъект.ДопСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДопСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
	ЭтотОбъект.ДопСвойства.Удалить("Ошибки");
	
КонецПроцедуры

ЭтотОбъект.ДопСвойства = Новый Структура;
